Sloeber/arduino-eclipse-plugin/teensy/configuration/boards.txt
menu.usb=USB Type
menu.speed=CPU Speed
menu.keys=Keyboard Layout

teensy31.name=Teensy 3.1
teensy31.upload.protocol=halfkay
teensy31.upload.maximum_size=262144
teensy31.upload.maximum_ram_size=65536
teensy31.upload.speed=12000000
teensy31.upload.disable_flushing=true
teensy31.bootloader.path=undefined
teensy31.serial.restart_cmd=true
teensy31.serial.safe_baud_rates_only=true
teensy31.upload.tool=teensy_reboot
teensy31.build.mcu=cortex-m4
teensy31.build.cpu=cortex-m4
teensy31.build.option1=-mthumb
teensy31.build.option2=-nostdlib
teensy31.build.option3=-D__MK20DX256__
teensy31.build.option4=-DTEENSYDUINO=120
#uncomment these 3 lines for use with Visual Micro + Studio 6
#teensy31.build.option5=-DF_CPU=96000000
#teensy31.build.option6=-DUSB_SERIAL
#teensy31.build.option7=-DLAYOUT_US_ENGLISH
teensy31.build.cppoption1=-fno-rtti
teensy31.build.linkoption1=-mthumb
teensy31.build.additionalobject1=-larm_cortexM4l_math
teensy31.build.linkscript=mk20dx256.ld
teensy31.build.architecture=arm-none-eabi
teensy31.build.command.gcc=arm-none-eabi-gcc
teensy31.build.command.g++=arm-none-eabi-g++
teensy31.build.command.ar=arm-none-eabi-ar
teensy31.build.command.objcopy=arm-none-eabi-objcopy
teensy31.build.command.objdump=arm-none-eabi-objdump
teensy31.build.command.size=arm-none-eabi-size
teensy31.build.core=teensy3
teensy31.build.noarchive=true
teensy31.build.elide_constructors=true
teensy31.build.gnu0x=true
teensy31.build.dependency=true
teensy31.build.time_t=true
teensy31.build.ldscript=teensy/all/cores/teensy3/mk20dx256.ld
teensy31.build.post_compile_script=teensy_post_compile
teensy31.menu.usb.serial=Serial
teensy31.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy31.menu.usb.hid=Keyboard + Mouse + Joystick
teensy31.menu.usb.hid.build.define0=-DUSB_HID
teensy31.menu.usb.hid.fake_serial=teensy_gateway
teensy31.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy31.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensy31.menu.usb.midi=MIDI
teensy31.menu.usb.midi.build.define0=-DUSB_MIDI
teensy31.menu.usb.midi.fake_serial=teensy_gateway
teensy31.menu.usb.rawhid=Raw HID
teensy31.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy31.menu.usb.rawhid.fake_serial=teensy_gateway
teensy31.menu.usb.flightsim=Flight Sim Controls
teensy31.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy31.menu.usb.flightsim.fake_serial=teensy_gateway
#uncomment these if you want to try faster overclocking
#teensy31.menu.speed.168=168 MHz (overclock)
#teensy31.menu.speed.144=144 MHz (overclock)
#teensy31.menu.speed.120=120 MHz (overclock)
teensy31.menu.speed.96=96 MHz (overclock)
teensy31.menu.speed.72=72 MHz
teensy31.menu.speed.48=48 MHz
teensy31.menu.speed.24=24 MHz
teensy31.menu.speed.16nousb=16 MHz (No USB)
teensy31.menu.speed.8nousb=8 MHz (No USB)
teensy31.menu.speed.4nousb=4 MHz (No USB)
teensy31.menu.speed.2nousb=2 MHz (No USB)
teensy31.menu.speed.168.build.f_cpu=168000000
teensy31.menu.speed.144.build.f_cpu=144000000
teensy31.menu.speed.120.build.f_cpu=120000000
teensy31.menu.speed.96.build.f_cpu=96000000
teensy31.menu.speed.72.build.f_cpu=72000000
teensy31.menu.speed.48.build.f_cpu=48000000
teensy31.menu.speed.24.build.f_cpu=24000000
teensy31.menu.speed.16nousb.build.f_cpu=16000000
teensy31.menu.speed.8nousb.build.f_cpu=8000000
teensy31.menu.speed.4nousb.build.f_cpu=4000000
teensy31.menu.speed.2nousb.build.f_cpu=2000000
teensy31.menu.keys.en-us=US English
teensy31.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy31.menu.keys.fr-ca=Canadian French
teensy31.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy31.menu.keys.xx-ca=Canadian Multilingual
teensy31.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy31.menu.keys.cz-cz=Czech
teensy31.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensy31.menu.keys.da-da=Danish
teensy31.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy31.menu.keys.fi-fi=Finnish
teensy31.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy31.menu.keys.fr-fr=French
teensy31.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy31.menu.keys.fr-be=French Belgian
teensy31.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy31.menu.keys.fr-ch=French Swiss
teensy31.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy31.menu.keys.de-de=German
teensy31.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy31.menu.keys.de-dm=German (Mac)
teensy31.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy31.menu.keys.de-ch=German Swiss
teensy31.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy31.menu.keys.is-is=Icelandic
teensy31.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy31.menu.keys.en-ie=Irish
teensy31.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy31.menu.keys.it-it=Italian
teensy31.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy31.menu.keys.no-no=Norwegian
teensy31.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy31.menu.keys.pt-pt=Portuguese
teensy31.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy31.menu.keys.pt-br=Portuguese Brazilian
teensy31.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy31.menu.keys.es-es=Spanish
teensy31.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy31.menu.keys.es-mx=Spanish Latin America
teensy31.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy31.menu.keys.sv-se=Swedish
teensy31.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy31.menu.keys.tr-tr=Turkish (partial)
teensy31.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy31.menu.keys.en-gb=United Kingdom
teensy31.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy31.menu.keys.usint=US International
teensy31.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensy3.name=Teensy 3.0
teensy3.upload.protocol=halfkay
teensy3.upload.maximum_size=131072
teensy3.upload.maximum_ram_size=16384
teensy3.upload.speed=12000000
teensy3.upload.disable_flushing=true
teensy3.bootloader.path=undefined
teensy3.serial.restart_cmd=true
teensy3.serial.safe_baud_rates_only=true
teensy3.upload.tool=teensy_reboot
teensy3.build.mcu=cortex-m4
teensy3.build.cpu=cortex-m4
teensy3.build.option1=-mthumb
teensy3.build.option2=-nostdlib
teensy3.build.option3=-D__MK20DX128__
teensy3.build.option4=-DTEENSYDUINO=120
teensy3.build.cppoption1=-fno-rtti
teensy3.build.linkoption1=-mthumb
teensy3.build.additionalobject1=-larm_cortexM4l_math
teensy3.build.linkscript=mk20dx128.ld
teensy3.build.architecture=arm-none-eabi
teensy3.build.command.gcc=arm-none-eabi-gcc
teensy3.build.command.g++=arm-none-eabi-g++
teensy3.build.command.ar=arm-none-eabi-ar
teensy3.build.command.objcopy=arm-none-eabi-objcopy
teensy3.build.command.objdump=arm-none-eabi-objdump
teensy3.build.command.size=arm-none-eabi-size
teensy3.build.core=teensy3
teensy3.build.noarchive=true
teensy3.build.elide_constructors=true
teensy3.build.gnu0x=true
teensy3.build.dependency=true
teensy3.build.time_t=true
teensy3.build.ldscript=teensy/all/cores/teensy3/mk20dx128.ld
teensy3.build.post_compile_script=teensy_post_compile
teensy3.menu.usb.serial=Serial
teensy3.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy3.menu.usb.hid=Keyboard + Mouse + Joystick
teensy3.menu.usb.hid.build.define0=-DUSB_HID
teensy3.menu.usb.hid.fake_serial=teensy_gateway
teensy3.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy3.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensy3.menu.usb.midi=MIDI
teensy3.menu.usb.midi.build.define0=-DUSB_MIDI
teensy3.menu.usb.midi.fake_serial=teensy_gateway
teensy3.menu.usb.rawhid=Raw HID
teensy3.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy3.menu.usb.rawhid.fake_serial=teensy_gateway
teensy3.menu.usb.flightsim=Flight Sim Controls
teensy3.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy3.menu.usb.flightsim.fake_serial=teensy_gateway
teensy3.menu.speed.96=96 MHz (overclock)
teensy3.menu.speed.48=48 MHz
teensy3.menu.speed.24=24 MHz
teensy3.menu.speed.96.build.f_cpu=96000000
teensy3.menu.speed.48.build.f_cpu=48000000
teensy3.menu.speed.24.build.f_cpu=24000000
teensy3.menu.keys.en-us=US English
teensy3.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy3.menu.keys.fr-ca=Canadian French
teensy3.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy3.menu.keys.xx-ca=Canadian Multilingual
teensy3.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy3.menu.keys.cz-cz=Czech
teensy3.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensy3.menu.keys.da-da=Danish
teensy3.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy3.menu.keys.fi-fi=Finnish
teensy3.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy3.menu.keys.fr-fr=French
teensy3.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy3.menu.keys.fr-be=French Belgian
teensy3.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy3.menu.keys.fr-ch=French Swiss
teensy3.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy3.menu.keys.de-de=German
teensy3.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy3.menu.keys.de-dm=German (Mac)
teensy3.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy3.menu.keys.de-ch=German Swiss
teensy3.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy3.menu.keys.is-is=Icelandic
teensy3.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy3.menu.keys.en-ie=Irish
teensy3.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy3.menu.keys.it-it=Italian
teensy3.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy3.menu.keys.no-no=Norwegian
teensy3.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy3.menu.keys.pt-pt=Portuguese
teensy3.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy3.menu.keys.pt-br=Portuguese Brazilian
teensy3.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy3.menu.keys.es-es=Spanish
teensy3.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy3.menu.keys.es-mx=Spanish Latin America
teensy3.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy3.menu.keys.sv-se=Swedish
teensy3.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy3.menu.keys.tr-tr=Turkish (partial)
teensy3.menu.keys.tr-tr.build.define1=-DLAYOUT_TURKISH
teensy3.menu.keys.en-gb=United Kingdom
teensy3.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy3.menu.keys.usint=US International
teensy3.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

