Sloeber/arduino-eclipse-plugin/teensy/configuration/boards.txt
teensy2.name=Teensy 2.0
teensy2.upload.protocol=halfkay
teensy2.upload.maximum_size=32256
teensy2.upload.maximum_ram_size=2560
teensy2.upload.speed=12000000
teensy2.upload.disable_flushing=true
teensy2.bootloader.path=undefined
teensy2.serial.restart_cmd=true
teensy2.serial.safe_baud_rates_only=true
teensy2.upload.tool=teensy_reboot
teensy2.build.mcu=atmega32u4
teensy2.build.option1=-DTEENSYDUINO=120
teensy2.build.core=teensy
teensy2.build.elide_constructors=true
teensy2.build.cpp0x=true
teensy2.build.dependency=true
teensy2.build.linker_relaxation=true
teensy2.build.post_compile_script=teensy_post_compile
teensy2.build.serial_number=true
teensy2.menu.usb.serial=Serial
teensy2.menu.usb.serial.build.define0=-DUSB_SERIAL
teensy2.menu.usb.hid=Keyboard + Mouse + Joystick
teensy2.menu.usb.hid.build.define0=-DUSB_HID
teensy2.menu.usb.hid.fake_serial=teensy_gateway
teensy2.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensy2.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensy2.menu.usb.int_disk=Disk(Internal) + Keyboard
teensy2.menu.usb.int_disk.build.define0=-DUSB_DISK
teensy2.menu.usb.int_disk.fake_serial=teensy_gateway
teensy2.menu.usb.int_disk.build.elfpatch=mktinyfat
teensy2.menu.usb.sd_disk=Disk(SD Card) + Keyboard
teensy2.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
teensy2.menu.usb.sd_disk.fake_serial=teensy_gateway
teensy2.menu.usb.midi=MIDI
teensy2.menu.usb.midi.build.define0=-DUSB_MIDI
teensy2.menu.usb.midi.fake_serial=teensy_gateway
teensy2.menu.usb.rawhid=Raw HID
teensy2.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensy2.menu.usb.rawhid.fake_serial=teensy_gateway
teensy2.menu.usb.flightsim=Flight Sim Controls
teensy2.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensy2.menu.usb.flightsim.fake_serial=teensy_gateway
teensy2.menu.speed.16=16 MHz
teensy2.menu.speed.8=8 MHz
teensy2.menu.speed.4=4 MHz
teensy2.menu.speed.2=2 MHz
teensy2.menu.speed.1=1 MHz
teensy2.menu.speed.16.build.f_cpu=16000000L
teensy2.menu.speed.8.build.f_cpu=8000000L
teensy2.menu.speed.4.build.f_cpu=4000000L
teensy2.menu.speed.2.build.f_cpu=2000000L
teensy2.menu.speed.1.build.f_cpu=1000000L
teensy2.menu.keys.en-us=US English
teensy2.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensy2.menu.keys.fr-ca=Canadian French
teensy2.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensy2.menu.keys.xx-ca=Canadian Multilingual
teensy2.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensy2.menu.keys.cz-cz=Czech
teensy2.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensy2.menu.keys.da-da=Danish
teensy2.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensy2.menu.keys.fi-fi=Finnish
teensy2.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensy2.menu.keys.fr-fr=French
teensy2.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensy2.menu.keys.fr-be=French Belgian
teensy2.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensy2.menu.keys.fr-ch=French Swiss
teensy2.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensy2.menu.keys.de-de=German
teensy2.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensy2.menu.keys.de-dm=German (Mac)
teensy2.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensy2.menu.keys.de-ch=German Swiss
teensy2.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensy2.menu.keys.is-is=Icelandic
teensy2.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensy2.menu.keys.en-ie=Irish
teensy2.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensy2.menu.keys.it-it=Italian
teensy2.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensy2.menu.keys.no-no=Norwegian
teensy2.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensy2.menu.keys.pt-pt=Portuguese
teensy2.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensy2.menu.keys.pt-br=Portuguese Brazilian
teensy2.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensy2.menu.keys.es-es=Spanish
teensy2.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensy2.menu.keys.es-mx=Spanish Latin America
teensy2.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensy2.menu.keys.sv-se=Swedish
teensy2.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensy2.menu.keys.en-gb=United Kingdom
teensy2.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensy2.menu.keys.usint=US International
teensy2.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensypp2.name=Teensy++ 2.0
teensypp2.upload.protocol=halfkay
teensypp2.upload.maximum_size=130048
teensypp2.upload.maximum_ram_size=8192
teensypp2.upload.speed=12000000
teensypp2.upload.disable_flushing=true
teensypp2.bootloader.path=undefined
teensypp2.serial.restart_cmd=true
teensypp2.serial.safe_baud_rates_only=true
teensypp2.upload.tool=teensy_reboot
teensypp2.build.mcu=at90usb1286
teensypp2.build.option1=-DTEENSYDUINO=120
teensypp2.build.core=teensy
teensypp2.build.elide_constructors=true
teensypp2.build.cpp0x=true
teensypp2.build.dependency=true
teensypp2.build.linker_relaxation=true
teensypp2.build.post_compile_script=teensy_post_compile
teensypp2.build.serial_number=true
teensypp2.menu.usb.serial=Serial
teensypp2.menu.usb.serial.build.define0=-DUSB_SERIAL
teensypp2.menu.usb.hid=Keyboard + Mouse + Joystick
teensypp2.menu.usb.hid.build.define0=-DUSB_HID
teensypp2.menu.usb.hid.fake_serial=teensy_gateway
teensypp2.menu.usb.serialhid=Serial + Keyboard + Mouse + Joystick
teensypp2.menu.usb.serialhid.build.define0=-DUSB_SERIAL_HID
teensypp2.menu.usb.int_disk=Disk(Internal) + Keyboard
teensypp2.menu.usb.int_disk.build.define0=-DUSB_DISK
teensypp2.menu.usb.int_disk.fake_serial=teensy_gateway
teensypp2.menu.usb.int_disk.build.elfpatch=mktinyfat
teensypp2.menu.usb.sd_disk=Disk(SD Card) + Keyboard
teensypp2.menu.usb.sd_disk.build.define0=-DUSB_DISK_SDFLASH
teensypp2.menu.usb.sd_disk.fake_serial=teensy_gateway
teensypp2.menu.usb.midi=MIDI
teensypp2.menu.usb.midi.build.define0=-DUSB_MIDI
teensypp2.menu.usb.midi.fake_serial=teensy_gateway
teensypp2.menu.usb.rawhid=Raw HID
teensypp2.menu.usb.rawhid.build.define0=-DUSB_RAWHID
teensypp2.menu.usb.rawhid.fake_serial=teensy_gateway
teensypp2.menu.usb.flightsim=Flight Sim Controls
teensypp2.menu.usb.flightsim.build.define0=-DUSB_FLIGHTSIM
teensypp2.menu.usb.flightsim.fake_serial=teensy_gateway
teensypp2.menu.speed.16=16 MHz
teensypp2.menu.speed.8=8 MHz
teensypp2.menu.speed.4=4 MHz
teensypp2.menu.speed.2=2 MHz
teensypp2.menu.speed.1=1 MHz
teensypp2.menu.speed.16.build.f_cpu=16000000L
teensypp2.menu.speed.8.build.f_cpu=8000000L
teensypp2.menu.speed.4.build.f_cpu=4000000L
teensypp2.menu.speed.2.build.f_cpu=2000000L
teensypp2.menu.speed.1.build.f_cpu=1000000L
teensypp2.menu.keys.en-us=US English
teensypp2.menu.keys.en-us.build.define1=-DLAYOUT_US_ENGLISH
teensypp2.menu.keys.fr-ca=Canadian French
teensypp2.menu.keys.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
teensypp2.menu.keys.xx-ca=Canadian Multilingual
teensypp2.menu.keys.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
teensypp2.menu.keys.cz-cz=Czech
teensypp2.menu.keys.cz-cz.build.define1=-DLAYOUT_CZECH
teensypp2.menu.keys.da-da=Danish
teensypp2.menu.keys.da-da.build.define1=-DLAYOUT_DANISH
teensypp2.menu.keys.fi-fi=Finnish
teensypp2.menu.keys.fi-fi.build.define1=-DLAYOUT_FINNISH
teensypp2.menu.keys.fr-fr=French
teensypp2.menu.keys.fr-fr.build.define1=-DLAYOUT_FRENCH
teensypp2.menu.keys.fr-be=French Belgian
teensypp2.menu.keys.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
teensypp2.menu.keys.fr-ch=French Swiss
teensypp2.menu.keys.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
teensypp2.menu.keys.de-de=German
teensypp2.menu.keys.de-de.build.define1=-DLAYOUT_GERMAN
teensypp2.menu.keys.de-dm=German (Mac)
teensypp2.menu.keys.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
teensypp2.menu.keys.de-ch=German Swiss
teensypp2.menu.keys.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
teensypp2.menu.keys.is-is=Icelandic
teensypp2.menu.keys.is-is.build.define1=-DLAYOUT_ICELANDIC
teensypp2.menu.keys.en-ie=Irish
teensypp2.menu.keys.en-ie.build.define1=-DLAYOUT_IRISH
teensypp2.menu.keys.it-it=Italian
teensypp2.menu.keys.it-it.build.define1=-DLAYOUT_ITALIAN
teensypp2.menu.keys.no-no=Norwegian
teensypp2.menu.keys.no-no.build.define1=-DLAYOUT_NORWEGIAN
teensypp2.menu.keys.pt-pt=Portuguese
teensypp2.menu.keys.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
teensypp2.menu.keys.pt-br=Portuguese Brazilian
teensypp2.menu.keys.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
teensypp2.menu.keys.es-es=Spanish
teensypp2.menu.keys.es-es.build.define1=-DLAYOUT_SPANISH
teensypp2.menu.keys.es-mx=Spanish Latin America
teensypp2.menu.keys.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
teensypp2.menu.keys.sv-se=Swedish
teensypp2.menu.keys.sv-se.build.define1=-DLAYOUT_SWEDISH
teensypp2.menu.keys.en-gb=United Kingdom
teensypp2.menu.keys.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
teensypp2.menu.keys.usint=US International
teensypp2.menu.keys.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

teensy3.build.use_archiver=false
teensy3.recipe.c.o.pattern="{compiler.sam.path}arm-none-eabi-gcc" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib  -mcpu={build.mcu} -DF_CPU={build.f_cpu} -DTIME_T=1365449461 {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX128__  -DTEENSYDUINO=120 {includes} "{source_file}" -o "{object_file}"
teensy3.recipe.cpp.o.pattern="{compiler.sam.path}arm-none-eabi-g++" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib -fno-rtti -fno-exceptions -mcpu={build.mcu} -DF_CPU={build.f_cpu} {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX128__  -felide-constructors -std=gnu++0x -DTEENSYDUINO=120 {includes} "{source_file}" -o "{object_file}"
teensy3.recipe.ar.pattern="{compiler.sam.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
teensy3.recipe.c.combine.pattern="{compiler.sam.path}arm-none-eabi-gcc"  -Os -Wl,--gc-sections -mcpu={build.mcu} -mthumb "-T{runtime.hardware.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -lm 
teensy3.recipe.objcopy.eep.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep" 
teensy3.recipe.objcopy.hex.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -R .eeprom "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex" 
teensy3.recipe.size.pattern="{compiler.sam.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"

teensy31.build.use_archiver=false
teensy31.recipe.c.o.pattern="{compiler.sam.path}arm-none-eabi-gcc" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib  -mcpu={build.mcu} -DF_CPU={build.f_cpu} -DTIME_T=1365449461 {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX256__  -DTEENSYDUINO=120 {includes} "{source_file}" -o "{object_file}"
teensy31.recipe.cpp.o.pattern="{compiler.sam.path}arm-none-eabi-g++" -c -g -Os -w -ffunction-sections -fdata-sections -nostdlib -fno-rtti -fno-exceptions -mcpu={build.mcu} -DF_CPU={build.f_cpu} {build.define0} {build.define1} -MMD -D{software}={runtime.ide.version} {build.extra_flags} -mthumb  -D__MK20DX256__  -felide-constructors -std=gnu++0x -DTEENSYDUINO=120 {includes} "{source_file}" -o "{object_file}"
teensy31.recipe.ar.pattern="{compiler.sam.path}arm-none-eabi-ar" -r "{build.path}/{archive_file}" {object_file} 
teensy31.recipe.c.combine.pattern="{compiler.sam.path}arm-none-eabi-gcc"  -Os -Wl,--gc-sections -mcpu={build.mcu} -mthumb "-T{runtime.hardware.path}/{build.ldscript}" -o "{build.path}/{build.project_name}.elf" {object_files} -L"{build.path}" -lm 
teensy31.recipe.objcopy.eep.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -j .eeprom --set-section-flags=.eeprom=alloc,load --no-change-warnings --change-section-lma .eeprom=0 "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.eep" 
teensy31.recipe.objcopy.hex.pattern="{compiler.sam.path}arm-none-eabi-objcopy" -O ihex -R .eeprom "{build.path}/{build.project_name}.elf" "{build.path}/{build.project_name}.hex" 
teensy31.recipe.size.pattern="{compiler.sam.path}arm-none-eabi-size" -A "{build.path}/{build.project_name}.elf"
